# Dataframes

In [3]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import rand

In [5]:
np.random.seed(101)

In [16]:
df=pd.DataFrame(rand(5,4),index='A,B,C,D,E'.split(','),columns="a b c d".split(" "))

In [17]:
df

          a         b         c         d
A  0.625773  0.100850  0.710853  0.881330
B  0.695290  0.266173  0.909964  0.579618
C  0.359687  0.852634  0.246179  0.780444
D  0.045510  0.885041  0.276421  0.580924
E  0.910662  0.992591  0.062224  0.928481

## Selection and Indexing

In [18]:
df['a']

A    0.625773
B    0.695290
C    0.359687
D    0.045510
E    0.910662
Name: a, dtype: float64

In [27]:
print(df.loc['A'])
# or    
print(df.iloc[0])

a    0.625773
b    0.100850
c    0.710853
d    0.881330
Name: A, dtype: float64
a    0.625773
b    0.100850
c    0.710853
d    0.881330
Name: A, dtype: float64

In [28]:
df['new']=df['a']+df['b']

In [29]:
df

          a         b         c         d       new
A  0.625773  0.100850  0.710853  0.881330  0.726623
B  0.695290  0.266173  0.909964  0.579618  0.961463
C  0.359687  0.852634  0.246179  0.780444  1.212321
D  0.045510  0.885041  0.276421  0.580924  0.930551
E  0.910662  0.992591  0.062224  0.928481  1.903253

In [38]:
df.drop('new',axis=1,inplace=True)

In [39]:
df

          a         b         c         d
A  0.625773  0.100850  0.710853  0.881330
B  0.695290  0.266173  0.909964  0.579618
C  0.359687  0.852634  0.246179  0.780444
D  0.045510  0.885041  0.276421  0.580924
E  0.910662  0.992591  0.062224  0.928481

# Multi Index and Index Hierarchy

In [42]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [45]:
df=pd.DataFrame(rand(6,5),index=hier_index)

In [56]:
df

                  0         1         2         3         4
Group Num
G1    1    0.603498  0.454420  0.313479  0.380982  0.642812
      2    0.806533  0.130528  0.730565  0.005438  0.650661
      3    0.453049  0.200645  0.631129  0.017791  0.838551
G2    1    0.525546  0.370938  0.425750  0.265095  0.446408
      2    0.982653  0.752054  0.520926  0.462383  0.067457
      3    0.622840  0.719619  0.450736  0.684777  0.732571

In [52]:
df.loc['G1']

          0         1         2         3         4
1  0.603498  0.454420  0.313479  0.380982  0.642812
2  0.806533  0.130528  0.730565  0.005438  0.650661
3  0.453049  0.200645  0.631129  0.017791  0.838551

In [55]:
df.index.names=['Group','Num']

In [58]:
df.xs("G1")

            0         1         2         3         4
Num
1    0.603498  0.454420  0.313479  0.380982  0.642812
2    0.806533  0.130528  0.730565  0.005438  0.650661
3    0.453049  0.200645  0.631129  0.017791  0.838551

In [59]:
df.xs(["G1",1])

0    0.603498
1    0.454420
2    0.313479
3    0.380982
4    0.642812
Name: (G1, 1), dtype: float64

# Handling Missing Values

In [65]:
df=pd.DataFrame({'A':[1,2,3],
'B':[2,np.nan,3],
'C':[1,np.nan,np.nan]
}
)

In [66]:
df

   A    B    C
0  1  2.0  1.0
1  2  NaN  NaN
2  3  3.0  NaN

In [68]:
df.dropna()

   A    B    C
0  1  2.0  1.0

In [69]:
df.dropna(axis=1)

   A
0  1
1  2
2  3

In [70]:
df.dropna(thresh=2)

   A    B    C
0  1  2.0  1.0
2  3  3.0  NaN

In [71]:
df.fillna(value="Thresh")

   A       B       C
0  1       2       1
1  2  Thresh  Thresh
2  3       3  Thresh

# Groupby

# Merging, Joining and Concatenating
https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [9]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [10]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [11]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [15]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [16]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Pandas Operations

#### df[].unique()
#### df[].nunique()
#### df[''].value_counts()